Numpy >> array, dimensi, shape </br>
Pandas >> dataframe

In [1]:
import pandas as pd
import numpy as np

In [2]:
x = np.array([1,2,3,4,5,6,7,8,9])
xSeries = pd.Series(x)
print (xSeries)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [3]:
xDataFrame = pd.DataFrame(x, columns=["Nilai"])
xDataFrame

   Nilai
0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9

In [4]:
xDataFrame = pd.DataFrame([[1,2], [3,4], [5,6]], columns=["A","B"])
xDataFrame

   A  B
0  1  2
1  3  4
2  5  6

In [5]:
xDataFrame.head(2)

   A  B
0  1  2
1  3  4

Menggunakan fungsi .head untuk melihat data dari awal

In [6]:
xDataFrame.tail(1)

   A  B
2  5  6

Menggunakan fungsi .tail untuk melihat data dari belakang

In [7]:
xDataFrame["A"]

0    1
1    3
2    5
Name: A, dtype: int64

Hanya menampilkan kolom tertentu

----

In [9]:
x = [9,2,5,3,4,5,7,4,3,5,7]
y = pd.Series(x)
y

0     9
1     2
2     5
3     3
4     4
5     5
6     7
7     4
8     3
9     5
10    7
dtype: int64

Bisa membuat series langsung dari list maupun dari array

In [10]:
type(y)

pandas.core.series.Series

Untuk memanggil series, menggunakan prinsip yang sama dengan indeks dalam list

In [11]:
y[0]

9

Tidak seperti Numpy yang hanya bisa berupa int/float, Pandas bisa memasukkan string maupun boolean ke dalam series.

In [12]:
x = ["Andi", "Budi", "Caca"]
y = pd.Series(x)
y

0    Andi
1    Budi
2    Caca
dtype: object

In [13]:
y[0]

'Andi'

In [14]:
x = [9,2,5,3,4]
y = pd.Series(x, index = ["a", "b", "c", "d", "e"])
y

a    9
b    2
c    5
d    3
e    4
dtype: int64

In [15]:
y["a"]

9

Elemen dapat dipanggil dengan indeks baru yang sudah ditetapkan

In [16]:
x = [9,2,5,3,4]
y = pd.Series(data = x, index = list("abcde"), name = "Test")
y

a    9
b    2
c    5
d    3
e    4
Name: Test, dtype: int64

In [17]:
y = pd.Series(data = {"a":1, "b":2},
              name = "Test")
y

a    1
b    2
Name: Test, dtype: int64

----
### Dataframe

In [18]:
x = [2,4,6,8,10]
df = pd.DataFrame(x, columns=["Nilai"])
baris, kolom = df.shape

In [19]:
baris

5

In [20]:
kolom

1

In [21]:
df

   Nilai
0      2
1      4
2      6
3      8
4     10

In [35]:
x = [2,4,6,8,10]
y = [1,3,5,7,9]
df = pd.DataFrame(np.array([x,y]).transpose(), columns = ["Genap", "Ganjil"], index = list("abcde"))
df

   Genap  Ganjil
a      2       1
b      4       3
c      6       5
d      8       7
e     10       9

In [37]:
z = (map(lambda a,b : [a,b], x, y))
list(z)

[[2, 1], [4, 3], [6, 5], [8, 7], [10, 9]]

In [38]:
df["Genap"]

a     2
b     4
c     6
d     8
e    10
Name: Genap, dtype: int64

Bisa memasukkan data via series dengan membuat dataframe kosong terlebih dahulu.

In [40]:
z = list("david")
df = pd.DataFrame()
df["X"] = x
df["Y"] = y
df["Z"] = z
df

    X  Y  Z
0   2  1  d
1   4  3  a
2   6  5  v
3   8  7  i
4  10  9  d

----

In [42]:
data = [
    ["Andi", "Jakarta", "PNS"],
    ["Budi", "Jakarta", "Karyawan Swasta"],
    ["Caca", "Jakarta", "Ibu Rumah Tangga"]
]
dfData = pd.DataFrame(data,
                     index = list("xyz"),
                     columns = ["Nama", "Kota", "Pekerjaan"])
dfData

   Nama     Kota         Pekerjaan
x  Andi  Jakarta               PNS
y  Budi  Jakarta   Karyawan Swasta
z  Caca  Jakarta  Ibu Rumah Tangga

In [45]:
data = {
    "x": [123,321,213],
    "y": [234,432,324],
    "z": [345,543,435]
}
df = pd.DataFrame(data, index=["depan", "belakang", "tengah"])
df

            x    y    z
depan     123  234  345
belakang  321  432  543
tengah    213  324  435

In [47]:
data = [
    {"nama":"Andi", "kota":"Jakarta"},
    {"nama":"Andi", "kota":"Jakarta", "job":np.nan},
    {"nama":"Andi", "kota":"Jakarta", "job":"NaN"},
    {"nama":"Andi", "kota":"Jakarta", "job":"PNS"}
]
df = pd.DataFrame(data)
df

   nama     kota  job
0  Andi  Jakarta  NaN
1  Andi  Jakarta  NaN
2  Andi  Jakarta  NaN
3  Andi  Jakarta  PNS

NaN = Not a Number

__Memasukkan Series ke dalam DataFrame__

In [49]:
x = [1,2,3,4,5]
x = pd.Series(x, name="Test")
df = pd.DataFrame(x)
df

   Test
0     1
1     2
2     3
3     4
4     5

In [50]:
x = [1,2,3,4,5]
y = [5,4,3,2,1]
x = pd.Series(x)
y = pd.Series(y)
df = pd.DataFrame({
    "Col.X":x,
    "Col.Y":y
})
df

   Col.X  Col.Y
0      1      5
1      2      4
2      3      3
3      4      2
4      5      1

In [51]:
x = [1,2,3,4,5]
y = [5,4,3,2,1]
x = pd.Series(x, name="test")
y = pd.Series(y, name="try")
df = pd.DataFrame({
    x.name :x,
    y.name :y
})
df

   test  try
0     1    5
1     2    4
2     3    3
3     4    2
4     5    1

----

In [59]:
df = pd.DataFrame({
    "A": np.arange(20,26),
    "B": [32,4,12,54,21,18],
    "C": 99,
    "D": np.ones(6),
    "E": np.random.rand(6)
}, index = list("abcdef"))
df

    A   B   C    D         E
a  20  32  99  1.0  0.796566
b  21   4  99  1.0  0.246373
c  22  12  99  1.0  0.056567
d  23  54  99  1.0  0.195171
e  24  21  99  1.0  0.848654
f  25  18  99  1.0  0.553528

Defaultnya, .head tanpa isian akan menampilkan 5 data pertama

In [60]:
df.head()

    A   B   C    D         E
a  20  32  99  1.0  0.796566
b  21   4  99  1.0  0.246373
c  22  12  99  1.0  0.056567
d  23  54  99  1.0  0.195171
e  24  21  99  1.0  0.848654

Shape untuk melihat shape dari Dataframe, </br>
Index untuk menampilkan indeks, </br>
dan Column untuk menampilkan kolom.

In [57]:
df.shape

(6, 5)

In [61]:
list(df.index)

['a', 'b', 'c', 'd', 'e', 'f']

In [62]:
list(df.columns)

['A', 'B', 'C', 'D', 'E']

Values untuk menampilkan seluruh data

In [64]:
df.values

array([[2.00000000e+01, 3.20000000e+01, 9.90000000e+01, 1.00000000e+00,
        7.96565914e-01],
       [2.10000000e+01, 4.00000000e+00, 9.90000000e+01, 1.00000000e+00,
        2.46372970e-01],
       [2.20000000e+01, 1.20000000e+01, 9.90000000e+01, 1.00000000e+00,
        5.65669624e-02],
       [2.30000000e+01, 5.40000000e+01, 9.90000000e+01, 1.00000000e+00,
        1.95171435e-01],
       [2.40000000e+01, 2.10000000e+01, 9.90000000e+01, 1.00000000e+00,
        8.48653805e-01],
       [2.50000000e+01, 1.80000000e+01, 9.90000000e+01, 1.00000000e+00,
        5.53528499e-01]])

Describe untuk menampilkan insight dari data

In [65]:
df.describe()

               A          B     C    D         E
count   6.000000   6.000000   6.0  6.0  6.000000
mean   22.500000  23.500000  99.0  1.0  0.449477
std     1.870829  17.615334   0.0  0.0  0.331946
min    20.000000   4.000000  99.0  1.0  0.056567
25%    21.250000  13.500000  99.0  1.0  0.207972
50%    22.500000  19.500000  99.0  1.0  0.399951
75%    23.750000  29.250000  99.0  1.0  0.735807
max    25.000000  54.000000  99.0  1.0  0.848654

In [66]:
df

    A   B   C    D         E
a  20  32  99  1.0  0.796566
b  21   4  99  1.0  0.246373
c  22  12  99  1.0  0.056567
d  23  54  99  1.0  0.195171
e  24  21  99  1.0  0.848654
f  25  18  99  1.0  0.553528

In [67]:
df.sort_index(ascending=False)

    A   B   C    D         E
f  25  18  99  1.0  0.553528
e  24  21  99  1.0  0.848654
d  23  54  99  1.0  0.195171
c  22  12  99  1.0  0.056567
b  21   4  99  1.0  0.246373
a  20  32  99  1.0  0.796566

In [68]:
df.sort_index(ascending=False, axis=1)

          E    D   C   B   A
a  0.796566  1.0  99  32  20
b  0.246373  1.0  99   4  21
c  0.056567  1.0  99  12  22
d  0.195171  1.0  99  54  23
e  0.848654  1.0  99  21  24
f  0.553528  1.0  99  18  25